# General Panda Testing

## Using the Pandas "getting started tutorial"

In [2]:
import pandas as pd

In [20]:
# creates a dataframe from scratch. cols (series) created in order they are entered. 
# the 'name' series contains the records for the df. the subsequent series add data the records in order.
df = pd.DataFrame(
    {
        'name': [
            'Braund, Mr. Owen Harris',
            'Allen, Mr. William Henry',
            'Bonnell, Mss. Elizabeth',
        ],
        'age': [22, 35,58],
        'sex': ['male', 'male', 'female'],
    }
)

In [17]:
#shows the df
df

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2   Bonnell, Mss. Elizabeth   58  female

In [21]:
# shoes the 'age' series in the df
df['age']

0    22
1    35
2    58
Name: age, dtype: int64

In [24]:
#shows the MAX value in the 'age' series
df['age'].max()

58

In [25]:
#shows the MIN value in the 'age' series
df['age'].min()

22

In [26]:
#shows basic stats of the df. only describes 'age' series because the data type is integer
df.describe()

             age
count   3.000000
mean   38.333333
std    18.230012
min    22.000000
25%    28.500000
50%    35.000000
75%    46.500000
max    58.000000

# Reading Tabular data
## using the exercise 1 parquet file

In [3]:
mtcars = pd.read_csv('gs://calitp-analytics-data/data-analyses/csuyat_folder/exercise1_v2.1.csv')

/opt/conda/lib/python3.9/site-packages/google/auth/_default.py:78: UserWarning: Your application has authenticated using end user credentials from Google Cloud SDK without a quota project. You might receive a "quota exceeded" or "API not enabled" error. See the following page for troubleshooting: https://cloud.google.com/docs/authentication/adc-troubleshooting/user-creds.
  warnings.warn(_CLOUD_SDK_CREDENTIALS_WARNING)

In [4]:
mtcars.head(5)

,Unnamed: 0,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb,cyl_cat
0,0,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4,six
1,1,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4,six
2,2,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1,four
3,3,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1,six
4,4,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2,eight

In [5]:
mtcars.dtypes

Unnamed: 0      int64
mpg           float64
cyl             int64
disp          float64
hp              int64
drat          float64
wt            float64
qsec          float64
vs              int64
am              int64
gear            int64
carb            int64
cyl_cat        object
dtype: object

# Select a subset from a df
## use the titanic df from earlier

In [36]:
# using a '=' will define a 'variable'(?)
# in this example "ages" will us the 'age' series from the df

ages = df['age']

In [37]:
# print the 'ages' subset from above
ages

0    22
1    35
2    58
Name: age, dtype: int64

In [40]:
#create a new subset for age and sex of titanic passengers
#note double brackets for this syntax

age_sex = df[['age','sex']]

age_sex

   age     sex
0   22    male
1   35    male
2   58  female

In [46]:
#filtering the df

above_35 = df[df['age'] >= 35]

above_35

                       name  age     sex
1  Allen, Mr. William Henry   35    male
2   Bonnell, Mss. Elizabeth   58  female

In [47]:
above_35.shape

(2, 3)

In [6]:
air_quality = pd.read_csv("https://github.com/pandas-dev/pandas/blob/main/doc/data/air_quality_no2.csv")

ParserError: Error tokenizing data. C error: Expected 1 fields in line 33, saw 8

In [12]:
name = 'Christian Suyat'

print (f'my name is {name}')

my name is Christian Suyat